app/Models/Employee.php

    public function getDataEmployee() {
        return $this->findAll();
---
SELECT *
FROM `employee`

    public function deleteDataEmployee(array $id_employee) {
        return $this->delete($id_employee);
---
DELETE FROM `employee`
WHERE `id` IN ('5')

    public function updateDataEmployee(array $id_employee, String $status) {
        return $this->whereIn('id', $id_employee)
                    ->set(['status' => $status])
                    ->update();
---
UPDATE `employee` SET `status` = 'Inactive', `updated_at` = '2025-01-07 07:21:09'
WHERE `id` IN ('5')